app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]
---
  def destroy
    @school_class = SchoolClass.find(params[:id])
    @school_class.destroy